Revit 2025 API
ZJustification Enumeration
 The justification of the framing element in Z.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum ZJustification
Public Enumeration ZJustification
public enum class ZJustification
type ZJustification
Members
Member name | Value | Description
Top | 0 |  Justification to the top of the element.
Center | 1 |  Justification to the geometrical center of element.
Origin | 2 |  Justification to the origin of the element.
Bottom | 3 |  Justification to the bottom of the element.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace